{"config": {"name": "sequential_32", "layers": [{"config": {"data_format": "channels_first", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 3, 32, 32], "name": "flatten_32"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 256, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_122", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"scale": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_92", "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_92"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_123", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"scale": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_93", "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_93"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 64, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_124", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"scale": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_94", "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_94"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_125", "bias_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}